yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl53f4.h
/* TIM3 Slave Mode Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM3_SMCR;
#endif
__IO_REG8_BIT(TIM3_SMCR,   0x5282, __READ_WRITE, __BITS_TIM3_SMCR);

/* TIM3 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM3_ETR;
#endif
__IO_REG8_BIT(TIM3_ETR,    0x5283, __READ_WRITE, __BITS_TIM3_ETR);

/* TIM3 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM3_IER;
#endif
__IO_REG8_BIT(TIM3_IER,    0x5284, __READ_WRITE, __BITS_TIM3_IER);

/* TIM3 Status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM3_SR1;
#endif
__IO_REG8_BIT(TIM3_SR1,    0x5285, __READ_WRITE, __BITS_TIM3_SR1);

/* TIM3 Status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM3_SR2;
#endif
__IO_REG8_BIT(TIM3_SR2,    0x5286, __READ_WRITE, __BITS_TIM3_SR2);

/* TIM3 Event Generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM3_EGR;
#endif
__IO_REG8_BIT(TIM3_EGR,    0x5287, __WRITE, __BITS_TIM3_EGR);

/* TIM3 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char CC1S        : 2;
    unsigned char IC1PSC      : 2;
    unsigned char IC1F        : 3;
  } in;
  struct
  {
    unsigned char CC1S        : 2;
    unsigned char OC1FE       : 1;
    unsigned char OC1PE       : 1;
    unsigned char OC1M        : 3;
  } out;
} __BITS_TIM3_CCMR1;
#endif
__IO_REG8_BIT(TIM3_CCMR1,  0x5288, __READ_WRITE, __BITS_TIM3_CCMR1);

/* TIM3 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char CC2S        : 2;
    unsigned char IC2PSC      : 2;
    unsigned char IC2F        : 3;
  } in;
  struct
  {
    unsigned char CC2S        : 2;
    unsigned char OC2FE       : 1;
    unsigned char OC2PE       : 1;
    unsigned char OC2M        : 3;
  } out;
} __BITS_TIM3_CCMR2;
#endif
__IO_REG8_BIT(TIM3_CCMR2,  0x5289, __READ_WRITE, __BITS_TIM3_CCMR2);

/* TIM3 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM3_CCER1;
#endif
__IO_REG8_BIT(TIM3_CCER1,  0x528A, __READ_WRITE, __BITS_TIM3_CCER1);

/* TIM3 Counter high */
__IO_REG8    (TIM3_CNTRH,  0x528B, __READ_WRITE);
/* TIM3 Counter low */
__IO_REG8    (TIM3_CNTRL,  0x528C, __READ_WRITE);
/* TIM3 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM3_PSCR;
#endif
__IO_REG8_BIT(TIM3_PSCR,   0x528D, __READ_WRITE, __BITS_TIM3_PSCR);

/* TIM3 Auto-reload register high */
__IO_REG8    (TIM3_ARRH,   0x528E, __READ_WRITE);
/* TIM3 Auto-reload register low */
__IO_REG8    (TIM3_ARRL,   0x528F, __READ_WRITE);
/* TIM3 Capture/Compare register 1 high */
__IO_REG8    (TIM3_CCR1H,  0x5290, __READ_WRITE);
/* TIM3 Capture/Compare register 1 low */
__IO_REG8    (TIM3_CCR1L,  0x5291, __READ_WRITE);
/* TIM3 Capture/Compare register 2 high */
__IO_REG8    (TIM3_CCR2H,  0x5292, __READ_WRITE);
/* TIM3 Capture/Compare register 2 low */
__IO_REG8    (TIM3_CCR2L,  0x5293, __READ_WRITE);
/* TIM3 Break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM3_BKR;
#endif
__IO_REG8_BIT(TIM3_BKR,    0x5294, __READ_WRITE, __BITS_TIM3_BKR);

/* TIM3 Output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char PIS2        : 1;
} __BITS_TIM3_OISR;
#endif
__IO_REG8_BIT(TIM3_OISR,   0x5295, __READ_WRITE, __BITS_TIM3_OISR);


/*-------------------------------------------------------------------------
 *      TIM3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM3_CR1_CEN             TIM3_CR1_bit.CEN
#define TIM3_CR1_UDIS            TIM3_CR1_bit.UDIS
#define TIM3_CR1_URS             TIM3_CR1_bit.URS
#define TIM3_CR1_OPM             TIM3_CR1_bit.OPM
#define TIM3_CR1_DIR             TIM3_CR1_bit.DIR
#define TIM3_CR1_CMS             TIM3_CR1_bit.CMS
#define TIM3_CR1_ARPE            TIM3_CR1_bit.ARPE

#define TIM3_CR2_MMS             TIM3_CR2_bit.MMS

#define TIM3_SMCR_SMS            TIM3_SMCR_bit.SMS
#define TIM3_SMCR_TS             TIM3_SMCR_bit.TS
#define TIM3_SMCR_MSM            TIM3_SMCR_bit.MSM

#define TIM3_ETR_ETF             TIM3_ETR_bit.ETF
#define TIM3_ETR_ETPS            TIM3_ETR_bit.ETPS
#define TIM3_ETR_ECE             TIM3_ETR_bit.ECE
#define TIM3_ETR_ETP             TIM3_ETR_bit.ETP

