yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl53f4.h
/* TIM4 Counter */
__IO_REG8    (TIM4_CNTR,   0x52E6, __READ_WRITE);
/* TIM4 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM4_PSCR;
#endif
__IO_REG8_BIT(TIM4_PSCR,   0x52E7, __READ_WRITE, __BITS_TIM4_PSCR);

/* TIM4 Auto-reload register low */
__IO_REG8    (TIM4_ARR,    0x52E8, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM4 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM4_CR1_CEN             TIM4_CR1_bit.CEN
#define TIM4_CR1_UDIS            TIM4_CR1_bit.UDIS
#define TIM4_CR1_URS             TIM4_CR1_bit.URS
#define TIM4_CR1_OPM             TIM4_CR1_bit.OPM
#define TIM4_CR1_ARPE            TIM4_CR1_bit.ARPE

#define TIM4_CR2_MMS             TIM4_CR2_bit.MMS

#define TIM4_SMCR_SMS            TIM4_SMCR_bit.SMS
#define TIM4_SMCR_TS             TIM4_SMCR_bit.TS
#define TIM4_SMCR_MSM            TIM4_SMCR_bit.MSM

#define TIM4_IER_UIE             TIM4_IER_bit.UIE
#define TIM4_IER_TIE             TIM4_IER_bit.TIE

#define TIM4_SR1_UIF             TIM4_SR1_bit.UIF
#define TIM4_SR1_TIF             TIM4_SR1_bit.TIF

#define TIM4_EGR_UG              TIM4_EGR_bit.UG
#define TIM4_EGR_TG              TIM4_EGR_bit.TG

#define TIM4_PSCR_PSC            TIM4_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM4 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM4_CR1_CEN        0x01
#define MASK_TIM4_CR1_UDIS       0x02
#define MASK_TIM4_CR1_URS        0x04
#define MASK_TIM4_CR1_OPM        0x08
#define MASK_TIM4_CR1_ARPE       0x80

#define MASK_TIM4_CR2_MMS        0x70

#define MASK_TIM4_SMCR_SMS       0x07
#define MASK_TIM4_SMCR_TS        0x70
#define MASK_TIM4_SMCR_MSM       0x80

#define MASK_TIM4_IER_UIE        0x01
#define MASK_TIM4_IER_TIE        0x40

#define MASK_TIM4_SR1_UIF        0x01
#define MASK_TIM4_SR1_TIF        0x40

#define MASK_TIM4_EGR_UG         0x01
#define MASK_TIM4_EGR_TG         0x40

#define MASK_TIM4_PSCR_PSC       0x0F


/*-------------------------------------------------------------------------
 *      ProxSense register definitions
 *-----------------------------------------------------------------------*/
/* ProxSense control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 5;
  unsigned char LOW_POWER   : 1;
  unsigned char START       : 1;
  unsigned char PXSEN       : 1;
} __BITS_PXS_CR1;
#endif
__IO_REG8_BIT(PXS_CR1,     0x5300, __READ_WRITE, __BITS_PXS_CR1);

/* ProxSense control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SYNCEDGE    : 1;
  unsigned char SYNCEN      : 1;
  unsigned char RXCOUPLING  : 1;
  unsigned char RXGROUP     : 1;
  unsigned char             : 1;
  unsigned char NOISEDETEN  : 1;
  unsigned char FCCITEN     : 1;
  unsigned char EOCITEN     : 1;
} __BITS_PXS_CR2;
#endif
__IO_REG8_BIT(PXS_CR2,     0x5301, __READ_WRITE, __BITS_PXS_CR2);

/* ProxSense control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VTHR        : 4;
  unsigned char BIAS        : 2;
  unsigned char STAB        : 2;
} __BITS_PXS_CR3;
#endif
__IO_REG8_BIT(PXS_CR3,     0x5302, __READ_WRITE, __BITS_PXS_CR3);

/* ProxSense interrupt and status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char SYNC_OVRF   : 1;
  unsigned char SYNCPF      : 1;
  unsigned char CIPF        : 1;
  unsigned char NOISEDETF   : 1;
  unsigned char FCCF        : 1;
  unsigned char EOCF        : 1;
} __BITS_PXS_ISR;
#endif
__IO_REG8_BIT(PXS_ISR,     0x5304, __READ, __BITS_PXS_ISR);

/* ProxSense clock control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PASSLEN     : 3;
  unsigned char             : 1;
  unsigned char PREUPLENSC  : 3;
} __BITS_PXS_CKCR1;
#endif
__IO_REG8_BIT(PXS_CKCR1,   0x5306, __READ_WRITE, __BITS_PXS_CKCR1);

/* ProxSense clock control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INCPHASE    : 1;
  unsigned char ANADEAD     : 1;
  unsigned char             : 2;
  unsigned char PRESC       : 3;
} __BITS_PXS_CKCR2;
#endif
__IO_REG8_BIT(PXS_CKCR2,   0x5307, __READ_WRITE, __BITS_PXS_CKCR2);

/* ProxSense receiver enable register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXEN8       : 1;
  unsigned char RXEN9       : 1;
} __BITS_PXS_RXENRH;
#endif
__IO_REG8_BIT(PXS_RXENRH,  0x5308, __READ_WRITE, __BITS_PXS_RXENRH);

/* ProxSense receiver enable register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXEN0       : 1;
  unsigned char RXEN1       : 1;
  unsigned char RXEN2       : 1;
  unsigned char RXEN3       : 1;
  unsigned char RXEN4       : 1;
  unsigned char RXEN5       : 1;
  unsigned char RXEN6       : 1;
  unsigned char RXEN7       : 1;
} __BITS_PXS_RXENRL;
#endif
__IO_REG8_BIT(PXS_RXENRL,  0x5309, __READ_WRITE, __BITS_PXS_RXENRL);

/* ProxSense receiver control register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR1_8     : 1;
  unsigned char RXCR1_9     : 1;
} __BITS_PXS_RXCR1H;
#endif
__IO_REG8_BIT(PXS_RXCR1H,  0x530A, __READ_WRITE, __BITS_PXS_RXCR1H);

/* ProxSense receiver control register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR1_0     : 1;
  unsigned char RXCR1_1     : 1;
  unsigned char RXCR1_2     : 1;
  unsigned char RXCR1_3     : 1;
  unsigned char RXCR1_4     : 1;
  unsigned char RXCR1_5     : 1;
  unsigned char RXCR1_6     : 1;
  unsigned char RXCR1_7     : 1;
} __BITS_PXS_RXCR1L;
#endif
__IO_REG8_BIT(PXS_RXCR1L,  0x530B, __READ_WRITE, __BITS_PXS_RXCR1L);

/* ProxSense receiver control register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR2_8     : 1;
  unsigned char RXCR2_9     : 1;
} __BITS_PXS_RXCR2H;
#endif
__IO_REG8_BIT(PXS_RXCR2H,  0x530C, __READ_WRITE, __BITS_PXS_RXCR2H);

/* ProxSense receiver control register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR2_0     : 1;
  unsigned char RXCR2_1     : 1;
  unsigned char RXCR2_2     : 1;
  unsigned char RXCR2_3     : 1;
  unsigned char RXCR2_4     : 1;
  unsigned char RXCR2_5     : 1;
  unsigned char RXCR2_6     : 1;
  unsigned char RXCR2_7     : 1;
} __BITS_PXS_RXCR2L;
#endif
__IO_REG8_BIT(PXS_RXCR2L,  0x530D, __READ_WRITE, __BITS_PXS_RXCR2L);

